МПР/src/DataProcessors/РабочееМестоКассира/РабочееМестоКассира.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКассира</name>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>DefinedType.ВидОперацииРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <type>
      <types>DefinedType.ТорговыйОбъектРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>DefinedType.КассаККМРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Число15_2РМК</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>DefinedType.НалогообложениеНДСРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>DefinedType.КассирРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>DefinedType.ДисконтнаяКартаРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательБД</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DefinedType.ЗаказПокупателяРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасчета</name>
    <type>
      <types>DefinedType.ДокументРасчетаРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияСДенежнымиСредствами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачивается</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Число15_3РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.Число15_3РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьВводаКодаМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>DefinedType.ОрганизацияРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <type>
        <types>DefinedType.Число5_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>DefinedType.Число5_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СистемаНалогообложения</name>
      <type>
        <types>DefinedType.ТипыСистемНалогообложенияККТРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>DefinedType.СтавкаНДСРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.НеотрицательноеЧисло15_2_РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>DefinedType.Число15_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезСкидки</name>
      <type>
        <types>DefinedType.НеотрицательноеЧисло15_2_РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.НеотрицательноеЧисло15_2_РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидкиНаценки</name>
      <type>
        <types>DefinedType.НеотрицательноеЧисло15_2_РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидкиОплатыБонусом</name>
      <type>
        <types>DefinedType.Число15_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ТорговыйОбъект</name>
      <type>
        <types>DefinedType.ТорговыйОбъектРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.УпаковкаРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Число15_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьВводаСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Продавец</name>
      <type>
        <types>DefinedType.ПродавецРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПартияРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеВариантУчета</name>
      <type>
        <types>EnumRef.ВариантыУчетаЧастичногоВыбытияИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеНоменклатура</name>
      <type>
        <types>DefinedType.НоменклатураРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеХарактеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаРМК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>DefinedType.ВидОплатыРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Число15_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <type>
        <types>DefinedType.ЭквайринговыйТерминалРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылочныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентКомиссии</name>
      <type>
        <types>DefinedType.Число5_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКомиссии</name>
      <type>
        <types>DefinedType.Число15_2РМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодарочныйСертификат</name>
      <type>
        <types>DefinedType.НоменклатураРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСертификата</name>
      <type>
        <types>DefinedType.НомерСертификатаРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПлатежнойСистемы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

МПР/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МПР/src/DataProcessors/РабочееМестоКассира/Forms/ФормаУстановкиКодаДоступаКассира/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ КассирНазначенПользователю Тогда
		
		ЭтаФорма.Закрыть(КодКассира);
		
		ТекстПоУмолчанию = НСтр("ru = 'Не задан кассир.
			|Пожалуйста, обратитесь к администратору.'");
		ПереопределенныйТекст = ОбщегоНазначенияРМККлиентПереопределяемый.ТекстОповещенияОНеназначенномКассире();
		ТекстПредупреждения = ?(ЗначениеЗаполнено(ПереопределенныйТекст), ПереопределенныйТекст, ТекстПоУмолчанию);
		ПоказатьПредупреждение(,ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КассирыРМК = СоответствиеСотрудниковПользователю();
	
	КоличествоСопоставленныхСотрудников = КассирыРМК.Количество();
	
	Если КоличествоСопоставленныхСотрудников >= 1 Тогда
		ПодготовитьФормуГенерацииШтрихкодаДляПользователей(КассирыРМК);
	КонецЕсли;

	КассирНазначенПользователю = КоличествоСопоставленныхСотрудников >= 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьКодПоEmailПриИзменении(Элемент)
	Элементы.ОтправкаEmail.Видимость = ОтправлятьКодПоEmail;
КонецПроцедуры

&НаКлиенте
Процедура КассирОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДанныеВыбраны = (ВыбранноеЗначение <> Неопределено);
	УстановитьДоступностьЭлементаФормы(Элементы.СгенерироватьКодДоступа, ДанныеВыбраны);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПриступитьКРаботе(Команда)
	ПередатьДанныеОНовомКодеДоступаВФормуРМК();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьEmail(Команда)
	ОтправитьEmailСНовымКодомДоступа();
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьКодДоступа(Команда)
	СформироватьНовыйКодДоступаСотрудника();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодДоступаСотрудника(Команда)
	ВывестиКодДоступаСотрудникаВТабличныйДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункции_ОтправкаEmail

&НаКлиенте
Процедура ОтправитьEmailСНовымКодомДоступа()
	
	Если ЗначениеЗаполнено(КодКассира) Тогда
		
		АдресЭлектроннойПочтыВалиден =
			ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Email);
			
		Если АдресЭлектроннойПочтыВалиден Тогда
			
			ОтправкаУспешна = ОтправитьEmailСНовымКодомДоступаНаСервере();
			ТекстОповещения = ?(ОтправкаУспешна,
				НСтр("ru = 'Письмо было успешно отправлено на указанный адрес.'"),
				НСтр("ru = 'Не удалось сформировать email для отправки нового кода доступа.
					|Пожалуйста, обратитесь к администратору.'"));
			
		Иначе
			ТекстОповещения = НСтр("ru = 'Пожалуйста, проверьте корректность адреса получателя кода доступа.'");
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстОповещения);
		
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Отсутствует значение кода кассира.
			|Пожалуйста, создайте новое значение и повторите попытку.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтправитьEmailСНовымКодомДоступаНаСервере()

	ОтправкаУспешна = Ложь;
	
	ТемаПисьма = НСтр("ru = 'Персональный код доступа в интерфейс кассира'");
	ТелоПисьма = СтрШаблон(НСтр("ru = 'Создан персональный код доступа в интерфейс рабочего места кассира.
		|Значение кода: %1'"), КодКассира);
	АдресПолучателя = Email;
	УстановитьПривилегированныйРежим(Истина);
	Результат = ОбщегоНазначенияРМКПереопределяемый.ОтправитьEmail(ТемаПисьма, ТелоПисьма, АдресПолучателя);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТипЗнч(Результат) = Тип("Булево") Тогда
		ОтправкаУспешна = Результат;
	КонецЕсли;
	
	Возврат ОтправкаУспешна;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ПодготовкаКодаДоступа

&НаКлиенте
Процедура ВывестиКодДоступаСотрудникаВТабличныйДокумент()

	Если ЗначениеЗаполнено(КодКассира) Тогда
		
		Результат = ПодготовитьКодДоступаКассираДляСохранения();
		Результат.Показать();
		
	Иначе
		
		ПоказатьПредупреждение(,
		НСтр("ru = 'Невозможно сохранить несозданный код.
			|Пожалуйста, сформируйте новый код и попробуйте снова.'"));
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ПодготовкаДанныхФормы

&НаКлиенте
Процедура ПередатьДанныеОНовомКодеДоступаВФормуРМК()
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("НовыйКодДоступа", КодКассира);
	Оповестить("СозданНовыйКодДоступа",ПараметрыОповещения, "ФормаВводаНовогоКодаДоступа");
	Закрыть(ПараметрыОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьНовыйКодДоступаСотрудника()
	
	НазначитьНовыйКодДоступаКассира();
	
	КодДоступаСформирован = НЕ ПустаяСтрока(КодКассира);
	
	Если НЕ КодДоступаСформирован Тогда
		
		ПоказатьПредупреждение(,
			НСтр("ru = 'Не удалось сформировать новый код доступа для кассира.
			| Пожалуйста, обратитесь за помощью к администратору.'"));
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементаФормы(Элементы.СохранитьКодДоступа, КодДоступаСформирован);
	УстановитьДоступностьЭлементаФормы(Элементы.ОтправлятьКодПоEmail, КодДоступаСформирован);
	УстановитьДоступностьЭлементаФормы(Элементы.ПриступитьКРаботе, КодДоступаСформирован);

КонецПроцедуры

&НаСервере
Функция СоответствиеСотрудниковПользователю()
	
	Результат = Новый Массив();
	
	ТекстЗапроса = ТекстЗапросаСоответствияКассираТекущемуПользователю();
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Если Результат.Найти(Выборка.Сотрудник) = Неопределено Тогда
			Результат.Добавить(Выборка.Сотрудник);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПодготовитьФормуГенерацииШтрихкодаДляПользователей(Сотрудники)
	
	КоличествоСотрудников = Сотрудники.Количество();

	Элементы.Кассир.КнопкаСпискаВыбора = (КоличествоСотрудников > 1);
	
	Если КоличествоСотрудников = 1 Тогда
		
		Кассир = Сотрудники[0];
		УстановитьТолькоПросмотрЭлементаФормы(Элементы.Кассир, Истина);
		
	Иначе
		
		Для Каждого Сотрудник Из Сотрудники Цикл
			Элементы.Кассир.СписокВыбора.Добавить(Сотрудник);
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементаФормы(Элементы.СгенерироватьКодДоступа, КоличествоСотрудников = 1);
	ПодготовитьЭлементыОтправкиКодаДоступаНаEmail();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьЭлементыОтправкиКодаДоступаНаEmail()
	
	ФункциональностьДоступна = ДоступнаОтправкаЭлектроннойПочты();
	УстановитьДоступностьЭлементаФормы(Элементы.ОтправкаEmail, ФункциональностьДоступна);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ВспомогательныеМетоды

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементаФормы(Элемент, Доступность)
	Элемент.Доступность = Доступность;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТолькоПросмотрЭлементаФормы(Элемент, ТолькоПросмотр)
	Элемент.ТолькоПросмотр = ТолькоПросмотр;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_Переопределение

&НаСервере
Функция ДоступнаОтправкаЭлектроннойПочты()

	ИмяПодсистемыДляРаботыСЭлектроннойПочтой = "СтандартныеПодсистемы.РаботаСПочтовымиСообщениями";
	ДоступнаОтправкаЭлектроннойПочтыНаОсновеБСП = ОбщегоНазначения.ПодсистемаСуществует(ИмяПодсистемыДляРаботыСЭлектроннойПочтой);
	ДоступнаОтправкаЭлектроннойПочтыБезБиблиотечнойФункциональности =
		ДоступнаОтправкаЭлектроннойПочтыБезБиблиотечнойФункциональности();
	Возврат ДоступнаОтправкаЭлектроннойПочтыНаОсновеБСП
		ИЛИ ДоступнаОтправкаЭлектроннойПочтыБезБиблиотечнойФункциональности;

КонецФункции

&НаСервереБезКонтекста
Функция ДоступнаОтправкаЭлектроннойПочтыБезБиблиотечнойФункциональности()

	ЗначениеПоУмолчанию = Ложь;
	ПереопределенноеЗначение = ОбщегоНазначенияРМКПереопределяемый.
		ДоступнаОтправкаЭлектроннойПочтыБезБиблиотечнойФункциональности();
	Результат = ?((ТипЗнч(ПереопределенноеЗначение) = Тип("Булево")) И ЗначениеПоУмолчанию <> ПереопределенноеЗначение,
		ПереопределенноеЗначение, ЗначениеПоУмолчанию);
	Возврат Результат;

КонецФункции


&НаСервере
Функция ПодготовитьКодДоступаКассираДляСохранения()
	
	Результат = Новый ТабличныйДокумент;
	
	РезультатПоУмолчанию = Новый ТабличныйДокумент;
	РезультатПоУмолчанию.Область("R2C1:R2C15").Текст = КодКассира;

	
	ИмяКассираСтрокой = Строка(Кассир);
	ПереопределенныйРезультат =
		ОбщегоНазначенияРМКПереопределяемый.ПодготовитьКодДоступаПользователяДляСохранения(КодКассира, ИмяКассираСтрокой);

	Результат = ?(ТипЗнч(ПереопределенныйРезультат) = Тип("ТабличныйДокумент"),
		ПереопределенныйРезультат, РезультатПоУмолчанию);
		
	Возврат Результат;
		
КонецФункции


&НаСервере
Процедура НазначитьНовыйКодДоступаКассира()

	УстановитьПривилегированныйРежим(Истина);
	
	КодСотрудникаПоУмолчанию = НовыйКодДоступаКассираПоУмолчанию();
	ПереопределенныйКодСотрудника = ОбщегоНазначенияРМКПереопределяемый.НовыйКодДоступаКассира();
	КодКНазначению =
		?(ЗначениеЗаполнено(ПереопределенныйКодСотрудника), ПереопределенныйКодСотрудника,КодСотрудникаПоУмолчанию);
	КодКассира = КодКНазначению;
	
	//тип владельца - пользователь, кассир - физлицо
	ВладелецКодаДоступа = ?(ТипЗнч(Кассир)= Тип("СправочникСсылка.ФизическиеЛица"),
		Пользователи.ТекущийПользователь(), Кассир);
	ОбщегоНазначенияРМКПереопределяемый.ПереопределитьВладельцаКодаДоступа(ВладелецКодаДоступа);
		
	УстановитьКодДоступаКассиру(ВладелецКодаДоступа, КодКНазначению);
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

&НаСервере
Функция УстановитьКодДоступаКассиру(ВладелецКодаДоступа, НазначаемыйКодДоступа) 

	УстановкаКодаУспешна = Ложь;
	
	ИмяМетаданныхХранящихКодыДоступа = ИмяМетаданныхХранящихКодыДоступаКассиров();
	ИмяРеквизитаХранящегоКодДоступаКассира = ИмяРеквизитаХранящегоКодДоступаКассира();

	ВозможноУстановитьНовыйКодДоступа = КритерийВозможностиУстановкиКодаДоступаВыполнен(ИмяМетаданныхХранящихКодыДоступа,
		ИмяРеквизитаХранящегоКодДоступаКассира);
		
		Если ВозможноУстановитьНовыйКодДоступа Тогда
			
				
			Если СтрНачинаетсяС(ИмяМетаданныхХранящихКодыДоступа, "Справочник") Тогда
				
				КассирОбъект = ВладелецКодаДоступа.ПолучитьОбъект();
				КассирОбъект[ИмяРеквизитаХранящегоКодДоступаКассира] = НазначаемыйКодДоступа;
				Попытка
					
					// АПК:1036-выкл: ответственное чтение не требуется, так как конкурентная работа с данными маловероятна
					КассирОбъект.Записать();
					// АПК:1036-вкл
					
				Исключение
					
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Установка нового кода доступа кассиру.'",
								ОбщегоНазначения.КодОсновногоЯзыка()),
						УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						
				КонецПопытки;
				
			ИначеЕсли СтрНачинаетсяС(ИмяМетаданныхХранящихКодыДоступа, "Регистр") Тогда
				
				ИмяПодклассаСущности = Сред(ИмяМетаданныхХранящихКодыДоступа, СтрНайти(ИмяМетаданныхХранящихКодыДоступа,".") + 1);
				МенеджерЗаписи = РегистрыСведений[ИмяПодклассаСущности].СоздатьМенеджерЗаписи();
				
				ИмяРеквизитаХранящегоВладельцаКодаДоступа = ИмяРеквизитаХранящегоВладельцаКодаДоступа();
				ВозможноСоздатьЗапись = КритерийВозможностиУстановкиКодаДоступаВыполнен(ИмяМетаданныхХранящихКодыДоступа,
					ИмяРеквизитаХранящегоВладельцаКодаДоступа);
					
					Если ВозможноСоздатьЗапись Тогда
						
						МенеджерЗаписи[ИмяРеквизитаХранящегоВладельцаКодаДоступа] = ВладелецКодаДоступа;
						МенеджерЗаписи[ИмяРеквизитаХранящегоКодДоступаКассира] = НазначаемыйКодДоступа;
						
						Попытка
							МенеджерЗаписи.Записать();
						Исключение
							
							ЗаписьЖурналаРегистрации(НСтр("ru = 'Установка нового кода доступа кассиру.'",
								ОбщегоНазначения.КодОсновногоЯзыка()),
								УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							
						КонецПопытки;
						
					КонецЕсли;
				
			КонецЕсли;
			
			УстановкаКодаУспешна = Истина;
					
		КонецЕсли;
		
	Возврат УстановкаКодаУспешна;
	
КонецФункции

&НаСервере
Функция КритерийВозможностиУстановкиКодаДоступаВыполнен(ИмяМетаданных, ИмяРеквизита)
	Возврат ОбщегоНазначенияРМК.КритерийВозможностиОбращенияКСвойствуСущностиВыполнен(ИмяМетаданных, ИмяРеквизита);
КонецФункции


&НаСервереБезКонтекста
Функция ИмяМетаданныхХранящихКодыДоступаКассиров()
	Возврат ОбщегоНазначенияРМККлиентСервер.ИмяМетаданныхХранящихКодыДоступаКассиров();
КонецФункции

&НаСервереБезКонтекста
Функция ИмяРеквизитаХранящегоКодДоступаКассира()
	Возврат ОбщегоНазначенияРМККлиентСервер.ИмяРеквизитаХранящегоКодДоступаКассира();
КонецФункции

&НаСервереБезКонтекста
Функция ИмяРеквизитаХранящегоВладельцаКодаДоступа()
	Возврат ОбщегоНазначенияРМККлиентСервер.ИмяРеквизитаХранящегоВладельцаКодаДоступа();
КонецФункции

&НаСервереБезКонтекста
Функция НовыйКодДоступаКассираПоУмолчанию()
	
	СлучайноеЧислоСтрокой = "";
	Генератор = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	СлучайноеЧисло = Генератор.СлучайноеЧисло(0, 99999);
	
	Если СлучайноеЧисло < 10000 Тогда
		СлучайноеЧислоСтрокой = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка(СлучайноеЧисло), 5, "0");
	Иначе
		СлучайноеЧислоСтрокой = Формат(СлучайноеЧисло, "ЧГ=0");
	КонецЕсли;
	
	Возврат СлучайноеЧислоСтрокой;

КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаСоответствияКассираТекущемуПользователю()

	ТекстЗапросаПоУмолчанию = "ВЫБРАТЬ
	|	Пользователи.ФизическоеЛицо КАК Сотрудник
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &ТекущийПользователь
	|	И НЕ Пользователи.Недействителен
	|	И НЕ Пользователи.ПометкаУдаления";
	
	ПереопределяемыйТекстЗапроса = ОбщегоНазначенияРМКПереопределяемый.ТекстЗапросаСоответствияКассираТекущемуПользователю();
	Возврат ?(ЗначениеЗаполнено(ПереопределяемыйТекстЗапроса), ПереопределяемыйТекстЗапроса, ТекстЗапросаПоУмолчанию);
	

КонецФункции
	
#КонецОбласти

#КонецОбласти
